# Костя подключен к мобильному оператору «Мобайл». Абонентская плата Кости составляет A рублей в месяц. За эту стоимость Костя получает B мегабайт интернет-трафика. Если Костя выйдет за лимит трафика, то каждый следующий мегабайт будет стоить ему C рублей.
# Костя планирует потратить D мегабайт интернет-трафика в следующий месяц. Помогите ему сосчитать, во сколько рублей ему обойдется интернет.

# Формат входных данных
# Вводится  целых положительных числа  — стоимость тарифа Кости, размер тарифа Кости, стоимость каждого лишнего мегабайта, размер интернет-трафика Кости в следующем месяце. Числа во входном файле разделены пробелами.

# Формат выходных данных
# Выведите одно натуральное число — суммарные расходы Кости на интернет.

# Замечание
# В первом примере Костя сначала оплатит пакет интернета, после чего потратит на  мегабайт больше, чем разрешено по тарифу. Следовательно, за  мегабайт он дополняет отдельно, получившаяся стоимость  рублей.
# Во втором примере Костя укладывается в тарифный план, поэтому платит только за него.


A, B, C, D = map(int, input().split())

if D > B:
    extra_cost = (D - B) * C
    total_cost = A + extra_cost
else:
    total_cost = A

print(total_cost)
